In [1]:
import pandas as pd
import numpy as np
import pickle
from sqlalchemy import create_engine, inspect

# allow max columns to be displayed
pd.set_option('display.max_columns', None)
pd.set_option('display.max_colwidth', None)

In [2]:
database = "../../resources/HR_Data/HR_Attrition.db"
conn_string = f"sqlite:///{database}"

In [3]:
engine = create_engine(conn_string)

In [6]:
min_age = 55
max_age = 60

In [7]:
query = f"""
        SELECT
            ep.Age, 
            ew.Attrition
        FROM
            EmpPersonalInfo ep
        LEFT JOIN EmpWorkInfo ew ON
        ep.EmployeeID = ew.EmployeeID
        WHERE Age >= {min_age}
            AND Age <= {max_age}
        """
df = pd.read_sql(query, conn_string)
df.head()

   Age Attrition
0   55        No
1   55        No
2   58        No
3   57        No
4   55        No

In [12]:
job_role = '"Research Scientist"'


query = f"""
        SELECT
            ep.EmployeeID,
            ep.Gender,
            jr.JobRole,
            ew.MonthlyIncome,
            ew.YearsAtCompany
        FROM
            EmpPersonalInfo ep
        LEFT JOIN EmpWorkInfo ew ON
            ep.EmployeeID = ew.EmployeeID
        LEFT JOIN JobRoleKey jr ON
            ew.JobRoleID = jr.JobRoleID
        WHERE jr.JobRole = {job_role}
        """

df = pd.read_sql(query, conn_string)
df.head()

   EmployeeID  Gender             JobRole  MonthlyIncome  YearsAtCompany
0           2  Female  Research Scientist         544.57               5
1          14    Male  Research Scientist         749.06              10
2          22    Male  Research Scientist        1256.71              10
3          23  Female  Research Scientist         279.24               5
4          26  Female  Research Scientist         883.87              10

In [21]:
department = '"Sales"'


query = f"""
        SELECT
            dk.Department,
            count(ew.EmployeeID)
        FROM 
            EmpWorkInfo ew 
        LEFT JOIN DepartmentKey dk ON
            ew.DepartmentID = dk.DepartmentID
        WHERE dk.Department = {department}
        """

df = pd.read_sql(query, conn_string)
df.head()

  Department  count(ew.EmployeeID)
0      Sales                  1307